cmx-mobile-app-server/src/test/jmeter/cmx_mse.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.4" jmeter="2.9 r1437961">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="CMX Mobile App Server Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="CMX_MOBILE_APP_SERVER_IP" elementType="Argument">
            <stringProp name="Argument.name">CMX_MOBILE_APP_SERVER_IP</stringProp>
            <stringProp name="Argument.value">172.19.28.215</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">CMX Mobile Application Server IP Address</stringProp>
          </elementProp>
          <elementProp name="CMX_MOBILE_APP_SERVER_PORT" elementType="Argument">
            <stringProp name="Argument.name">CMX_MOBILE_APP_SERVER_PORT</stringProp>
            <stringProp name="Argument.value">8082</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">CMX Mobile Application Server Port (Default should be 8082)</stringProp>
          </elementProp>
          <elementProp name="CMX_MOBILE_APP_USER_ID" elementType="Argument">
            <stringProp name="Argument.name">CMX_MOBILE_APP_USER_ID</stringProp>
            <stringProp name="Argument.value">admin</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">CMX Mobile Application Server  user ID to authenticate MSE</stringProp>
          </elementProp>
          <elementProp name="CMX_MOBILE_APP_PASSWORD" elementType="Argument">
            <stringProp name="Argument.name">CMX_MOBILE_APP_PASSWORD</stringProp>
            <stringProp name="Argument.value">Public123</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">CMX Mobile Application Server  password  to authenticate MSE</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="MSE Server Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="MSE_UDI" elementType="Argument">
            <stringProp name="Argument.name">MSE_UDI</stringProp>
            <stringProp name="Argument.value">AIR-MSE-3355-K9:V01:KQYGBRD</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">MSE unique identifier to determine which MSE is sending updates</stringProp>
          </elementProp>
          <elementProp name="AUTHORIZATION_KEY" elementType="Argument">
            <stringProp name="Argument.name">AUTHORIZATION_KEY</stringProp>
            <stringProp name="Argument.value">1E092FD6-3F14-4EA5-9C9B-C38D241EECDD</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Authorization key set in each notification update</stringProp>
          </elementProp>
          <elementProp name="MSE_FLOOR_ID" elementType="Argument">
            <stringProp name="Argument.name">MSE_FLOOR_ID</stringProp>
            <stringProp name="Argument.value">77776666777766666</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">The identification for the one floor used</stringProp>
          </elementProp>
          <elementProp name="MSE_CLIENT_DEVICES_FILE" elementType="Argument">
            <stringProp name="Argument.name">MSE_CLIENT_DEVICES_FILE</stringProp>
            <stringProp name="Argument.value">./config/clientDevices.csv</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Client devices file listing the MAC addresses of the clients</stringProp>
          </elementProp>
          <elementProp name="MSE_MOVEMENT_THREAD_COUNT" elementType="Argument">
            <stringProp name="Argument.name">MSE_MOVEMENT_THREAD_COUNT</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Number of threads used to send movement events</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Send MSE Configuration Data" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1410909034000</longProp>
        <longProp name="ThreadGroup.end_time">1410909034000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTP Authorization Manager" enabled="true">
          <collectionProp name="AuthManager.auth_list">
            <elementProp name="" elementType="Authorization">
              <stringProp name="Authorization.username">${CMX_MOBILE_APP_USER_ID}</stringProp>
              <stringProp name="Authorization.password">${CMX_MOBILE_APP_PASSWORD}</stringProp>
            </elementProp>
          </collectionProp>
        </AuthManager>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${CMX_MOBILE_APP_SERVER_IP}</stringProp>
          <stringProp name="HTTPSampler.port">${CMX_MOBILE_APP_SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.implementation">HttpClient3.1</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Send setup configuraiton in JSON" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">[&#xd;
{ &quot;lat&quot; : &quot;0&quot;,&#xd;
  &quot;name&quot; : &quot;CiscoTestVenue&quot;,&#xd;
  &quot;description&quot; : &quot;Cisco Test Venue&quot;,&#xd;
  &quot;lon&quot; : &quot;0&quot;,&#xd;
  &quot;mseUdId&quot; : &quot;${MSE_UDI}&quot;,&#xd;
  &quot;mseVenueId&quot; : &quot;6666&quot;,&#xd;
  &quot;venueUdId&quot; : &quot;666677776666&quot;,&#xd;
  &quot;address&quot; : &quot;3625 Cisco Way, San Jose, CA 95131&quot;,&#xd;
  &quot;locationUpdateInterval&quot; : 10,&#xd;
  &quot;wifiConnectionMode&quot; : &quot;prompt&quot;,&#xd;
  &quot;authToken&quot; : &quot;${AUTHORIZATION_KEY}&quot;,&#xd;
  &quot;floorList&quot; : [ { &quot;venueUdId&quot; : &quot;666677776666&quot;,&#xd;
        &quot;mseFloorId&quot; : &quot;${MSE_FLOOR_ID}&quot;,&#xd;
        &quot;id&quot; : 11116666,&#xd;
        &quot;mseUdId&quot; : &quot;${MSE_UDI}&quot;,&#xd;
        &quot;mseVenueId&quot; : &quot;6666&quot;,&#xd;
        &quot;name&quot; : &quot;Main Floor&quot;,&#xd;
        &quot;description&quot; : &quot;Main Floor Description&quot;,&#xd;
        &quot;filename&quot; : &quot;777297895206518938.gif&quot;,&#xd;
        &quot;length&quot; : &quot;1154&quot;,&#xd;
        &quot;width&quot; : &quot;895&quot;&#xd;
      }&#xd;
    ]&#xd;
}&#xd;
]</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">cmx-cloud-server/api/v1/setup</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Configuration Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">8</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Send MSE Movement Event" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${MSE_MOVEMENT_THREAD_COUNT}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <longProp name="ThreadGroup.start_time">1366186434000</longProp>
        <longProp name="ThreadGroup.end_time">1366186434000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,300)}</stringProp>
      </ThreadGroup>
      <hashTree>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Counter" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.end">100</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">LOCATION_COUNTER</stringProp>
          <stringProp name="CounterConfig.format">0</stringProp>
          <boolProp name="CounterConfig.per_user">true</boolProp>
        </CounterConfig>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="filename">${MSE_CLIENT_DEVICES_FILE}</stringProp>
          <stringProp name="variableNames">DEVICE_MAC_ADDRESS</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${CMX_MOBILE_APP_SERVER_IP}</stringProp>
          <stringProp name="HTTPSampler.port">${CMX_MOBILE_APP_SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.implementation">HttpClient3.1</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Device Registration Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;MovementEvent&quot;:{&quot;moveDistanceInFt&quot;:&quot;10.00&quot;,&quot;subscriptionName&quot;:&quot;CMX_Location_Event&quot;,&quot;timeStamp&quot;:&quot;2013-06-10T19:16:26.065-0700&quot;,&quot;entity&quot;:&quot;WIRELESS_CLIENTS&quot;,&quot;deviceId&quot;:&quot;${DEVICE_MAC_ADDRESS}&quot;,&quot;mseUdi&quot;:&quot;${MSE_UDI}&quot;,&quot;floorRefId&quot;:&quot;${MSE_FLOOR_ID}&quot;,&quot;zoneId&quot;:&quot;78230912353602&quot;,&quot;clientAuthInfo&quot;:&quot;${AUTHORIZATION_KEY}&quot;,&quot;locationCoordinate&quot;:{&quot;x&quot;:&quot;${LOCATION_COUNTER}&quot;,&quot;y&quot;:&quot;${LOCATION_COUNTER}&quot;,&quot;unit&quot;:&quot;FEET&quot;}}}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/cmx-cloud-server/api/cmxmobile/v1/notify</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Configuration Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">8</intProp>
        </ResponseAssertion>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="DistributionGraphVisualizer" testclass="ResultCollector" testname="Distribution Graph (alpha)" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>